In [1]:
import pandas as pd

In [12]:
colours = pd.Series(["Red","Green","Blue"],name  = "colours")

In [13]:
colours

0      Red
1    Green
2     Blue
Name: colours, dtype: object

In [14]:
car_types = pd.Series(["SUV","Coupe","Crossover"],name = "car_type")

In [15]:
car_types

0          SUV
1        Coupe
2    Crossover
Name: car_type, dtype: object

In [18]:
cars = pd.concat([colours,car_types],axis = 1)

In [19]:
cars

  colours   car_type
0     Red        SUV
1   Green      Coupe
2    Blue  Crossover

In [20]:
cars_sales = pd.read_csv("car-sales.csv")

In [21]:
cars_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [22]:
cars.to_csv("cars.csv")

In [23]:
ls

 6-step-ml-framework.png      exaple-notebook.ipynb
 car-sales.csv               'Exercise-1  .ipynb'
 car-sales-missing-data.csv   exported-car-sales.csv
 cars.csv                     heart-disease.csv
 env/                         Introduction_to_pandas.ipynb

In [24]:
numbers= pd.Series([1,24,5,23,52,5])

In [25]:
numbers.mean()

18.333333333333332

In [26]:
numbers.sum()

110

In [29]:
cars_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [30]:
cars_sales.index

RangeIndex(start=0, stop=10, step=1)

In [32]:
len(cars_sales)

10

In [33]:
cars_sales.head(5)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [34]:
cars_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [35]:
cars_sales.tail(5)

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [39]:
cars_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [40]:
cars_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [41]:
cars_sales["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [42]:
cars_sales["Odometer (KM)"].mean()

78601.4

In [ ]:
cars_sales["Odometer (KM)"(cars_sales["Odometer (KM)"]< 10000)]

In [47]:
pd.crosstab(cars_sales.Make,cars_sales.Doors)

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0